### Dados absolutos e relativos

In [1]:
import pandas as pd

#### Percentuais

In [2]:
dados = {'emprego': ['Administrador_banco_dados', 'Programador', 'Arquiteto_redes'],
	'nova_jersey': [97350, 82080, 112840],
	'florida': [77140, 71540, 62310]}

In [3]:
dados, type(dados)

({'emprego': ['Administrador_banco_dados', 'Programador', 'Arquiteto_redes'],
  'nova_jersey': [97350, 82080, 112840],
  'florida': [77140, 71540, 62310]},
 dict)

In [4]:
dataset = pd.DataFrame(dados)
dataset

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2            Arquiteto_redes       112840    62310

In [5]:
dataset['nova_jersey'].sum()

np.int64(292270)

In [6]:
dataset['florida'].sum()

np.int64(210990)

In [7]:
dataset['%_nova_jersey'] = (dataset['nova_jersey'] / dataset['nova_jersey'].sum()) * 100

In [8]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100

In [9]:
dataset

                     emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Administrador_banco_dados        97350    77140      33.308242  36.560974
1                Programador        82080    71540      28.083621  33.906820
2            Arquiteto_redes       112840    62310      38.608136  29.532205

#### Coeficientes e taxas

In [11]:
dados = {'ano': ['1', '2', '3', '4', 'total'],
	'matriculas_marco': [70, 50, 47, 23, 190],
	'matriculas_novembro': [65, 48, 40, 22, 175]}
dados

{'ano': ['1', '2', '3', '4', 'total'],
 'matriculas_marco': [70, 50, 47, 23, 190],
 'matriculas_novembro': [65, 48, 40, 22, 175]}

In [12]:
dataset = pd.DataFrame(dados)
dataset

     ano  matriculas_marco  matriculas_novembro
0      1                70                   65
1      2                50                   48
2      3                47                   40
3      4                23                   22
4  total               190                  175

In [15]:
dataset['taxa_evasao'] = ((dataset['matriculas_marco'] - dataset['matriculas_novembro']) / dataset['matriculas_marco']) * 100
dataset

     ano  matriculas_marco  matriculas_novembro  taxa_evasao
0      1                70                   65     7.142857
1      2                50                   48     4.000000
2      3                47                   40    14.893617
3      4                23                   22     4.347826
4  total               190                  175     7.894737